---
kind: property
id: P:Autodesk.Revit.DB.PolylineSegments.EndParameter
source: html/fd9e2a51-69ed-b225-10b7-21c85f6ad4dd.htm
---
# Autodesk.Revit.DB.PolylineSegments.EndParameter Property

Parameter associated with the end point.

## Syntax (C#)
```csharp
public double EndParameter { get; }
```